__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
pitches_input (InputLayer)      (None, 128, 39)      0                                            
__________________________________________________________________________________________________
durations_input (InputLayer)    (None, 128, 18)      0                                            
__________________________________________________________________________________________________
h_lstm_p_1 (LSTM)               (None, 128, 256)     303104      pitches_input[0][0]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128, 128)     75264       durations_input[0][0]            
__________________________________________________________________________________________________
h_lstm_p_2 (LSTM)               (None, 128, 512)     1574912     h_lstm_p_1[0][0]                 
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 128, 256)     394240      lstm_1[0][0]                     
__________________________________________________________________________________________________
h_lstm_p_3 (LSTM)               (None, 128, 256)     787456      h_lstm_p_2[0][0]                 
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 128, 128)     197120      lstm_2[0][0]                     
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 128, 512)     131584      h_lstm_p_3[0][0]                 
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 128, 512)     131584      h_lstm_p_3[0][0]                 
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 128, 256)     33024       lstm_3[0][0]                     
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 128, 256)     33024       lstm_3[0][0]                     
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128, 512)     0           time_distributed_1[0][0]         
                                                                 time_distributed_2[0][0]         
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 128, 256)     0           time_distributed_4[0][0]         
                                                                 time_distributed_5[0][0]         
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 128, 39)      20007       lambda_1[0][0]                   
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 128, 18)      4626        lambda_2[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 57)      0           time_distributed_3[0][0]         
                                                                 time_distributed_6[0][0]         
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 128, 57)      3306        concatenate_1[0][0]              
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 256)          321536      time_distributed_7[0][0]         
__________________________________________________________________________________________________
pitches_output (Dense)          (None, 39)           10023       lstm_4[0][0]                     
__________________________________________________________________________________________________
durations_output (Dense)        (None, 18)           4626        lstm_4[0][0]                     
==================================================================================================
Total params: 4,025,436
Trainable params: 4,025,436
Non-trainable params: 0
__________________________________________________________________________________________________
