__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
generator_input (InputLayer)    (None, 128, 52)      0                                            
__________________________________________________________________________________________________
h_lstm_1 (LSTM)                 (None, 128, 256)     316416      generator_input[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 256)     0           h_lstm_1[0][0]                   
__________________________________________________________________________________________________
h_lstm_2 (LSTM)                 (None, 128, 512)     1574912     dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 512)     0           h_lstm_2[0][0]                   
__________________________________________________________________________________________________
h_lstm_3 (LSTM)                 (None, 128, 512)     2099200     dropout_2[0][0]                  
__________________________________________________________________________________________________
h_lstm_4 (LSTM)                 (None, 256)          787456      h_lstm_3[0][0]                   
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          131584      h_lstm_4[0][0]                   
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          131584      h_lstm_4[0][0]                   
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
__________________________________________________________________________________________________
generator_output (Dense)        (None, 52)           26676       z[0][0]                          
==================================================================================================
Total params: 5,067,828
Trainable params: 5,067,828
Non-trainable params: 0
__________________________________________________________________________________________________
