{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "generator_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 52], "dtype": "float32", "sparse": false, "name": "generator_input"}, "inbound_nodes": []}, {"name": "h_lstm_1", "class_name": "LSTM", "config": {"name": "h_lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["generator_input", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["h_lstm_1", 0, 0, {}]]]}, {"name": "h_lstm_2", "class_name": "LSTM", "config": {"name": "h_lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["h_lstm_2", 0, 0, {}]]]}, {"name": "h_lstm_3", "class_name": "LSTM", "config": {"name": "h_lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "h_lstm_4", "class_name": "LSTM", "config": {"name": "h_lstm_4", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["h_lstm_3", 0, 0, {}]]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["h_lstm_4", 0, 0, {}]]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["h_lstm_4", 0, 0, {}]]]}, {"name": "z", "class_name": "Lambda", "config": {"name": "z", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAQAAABDAAAAc0oAAAB8AFwCfQF9AnQAagF8AYMBZAEZAH0DdABqAnwBgwFk\nAhkAfQR0AGoDfAN8BGYCZAONAX0FfAF0AGoEZAR8AhQAgwF8BRQAFwBTACkFTukAAAAA6QEAAAAp\nAdoFc2hhcGXnAAAAAAAA4D8pBdoBS3IDAAAA2glpbnRfc2hhcGXaDXJhbmRvbV9ub3JtYWzaA2V4\ncCkG2gRhcmdz2gZ6X21lYW7aCXpfbG9nX3ZhctoFYmF0Y2jaA2RpbdoHZXBzaWxvbqkAcg8AAAD6\nEnBpdGNoLWdlbmVyYXRvci5wedoIc2FtcGxpbmceAAAAcwoAAAAAAQgBDgEOARAB\n", null, null], "function_type": "lambda", "output_shape": [512], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}, {"name": "generator_output", "class_name": "Dense", "config": {"name": "generator_output", "trainable": true, "units": 52, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z", 0, 0, {}]]]}], "input_layers": [["generator_input", 0, 0]], "output_layers": [["generator_output", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}